public class Matrix {


   static int[][] mat2 = {//матрица преобразований для отображения отностиельно оси X
            {1,0},
            {0,-1}

    };

    static int[][] mat4 = {//матрица преобразований для отображения отностиельно обоих осей
            {(-1),0},
            {0,-1}

    };
    static int[][] mat6= {// матрица преобразований для отбражения отностиельно оси Y
            {-1,0},
            {0,1}

    };

    static double[][] mat8= {// матрица дял увеличения масштаба
            {1.25,0},
            {0,1.25}

    };

 static double[][] mat10= {// матрица для уменьшения масштаба
         {0.8,0},
         {0,0.8}

 };


}
